In [1]:
import re
import pandas as pd

In [2]:
data = pd.read_csv(r'D:\Resume Classification System\data\processed\Combined_Data.csv')
data.head()

,Unnamed: 0,Category,Text
0,0,Designing,﻿________________\r\n\r\nJESSICA CLAIRE\r\nMon...
1,1,Accountant,﻿________________\r\n\r\nJESSICA CLAIRE\r\nMon...
2,2,SQL Developer,﻿________________\r\n\r\nJESSICA CLAIRE\r\n9\r...
3,3,Operations Manager,﻿________________\r\n\r\nJESSICA CLAIRE\r\nres...
4,4,Finance,﻿________________\r\n\r\nJESSICA CLAIRE\r\n100...

In [3]:
data.tail()

,Unnamed: 0,Category,Text
14030,14030,SQL Developer,﻿________________\r\n\r\nRODOLFO BOTSFORD\r\n6...
14031,14031,Information Technology,﻿________________\r\n\r\nJESSICA CLAIRE\r\n100...
14032,14032,Operations Manager,﻿________________\r\n\r\nJESSICA CLAIRE\r\n100...
14033,14033,Banking,﻿________________\r\n\r\nThomas Johnson\r\nInv...
14034,14034,Electrical Engineering,﻿________________\r\n\r\nSTONE BARROWS\r\n6547...

In [4]:
data = data.drop('Unnamed: 0',axis=1)

In [5]:
data.head()

             Category                                               Text
0           Designing  ﻿________________\r\n\r\nJESSICA CLAIRE\r\nMon...
1          Accountant  ﻿________________\r\n\r\nJESSICA CLAIRE\r\nMon...
2       SQL Developer  ﻿________________\r\n\r\nJESSICA CLAIRE\r\n9\r...
3  Operations Manager  ﻿________________\r\n\r\nJESSICA CLAIRE\r\nres...
4             Finance  ﻿________________\r\n\r\nJESSICA CLAIRE\r\n100...

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14035 entries, 0 to 14034
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Category  14035 non-null  object
 1   Text      14035 non-null  object
dtypes: object(2)
memory usage: 219.4+ KB

In [7]:
data.isnull().sum()

Category    0
Text        0
dtype: int64

In [8]:
data.shape

(14035, 2)

In [9]:
def text_preprocess(text):

    if not isinstance(text,str):
        return ""
    
    #URLs , E mails and Phone numbers
    text = re.sub(r'http\S+|www\S+|https\S+|\S+@\S+', '', text)
    text = re.sub(r'[\+\(]?[1-9][0-9 .\-\(\)]{8,}[0-9]', '', text) 
    
    #Underscores 
    text = re.sub(r'_\b[A-Z][A-Za-z]+\b \b[A-Z][A-Za-z]+\b', '', text)  
    text = re.sub(r'_\w+', '', text)  #
    
    #Address fragments 
    text = re.sub(r'\b\d+\s+[A-Z][a-z]+\s+\w+\b', '', text)
    
    #Whitespace and Unicode
    text = ' '.join(text.split())
    text = re.sub(r'[\u200b-\u200d\u202a-\u202e]', '', text)

    return text.strip()

In [10]:
data['Cleaned_Text'] = data['Text'].apply(text_preprocess)

In [11]:
data[['Category','Cleaned_Text']].head()

             Category                                       Cleaned_Text
0           Designing  ﻿ JESSICA CLAIRE Montgomery Street, San Franci...
1          Accountant  ﻿ JESSICA CLAIRE Montgomery Street, San Franci...
2       SQL Developer  ﻿ JESSICA CLAIRE , San Francisco, CA 94105 EXP...
3  Operations Manager  ﻿ JESSICA CLAIRE . 10th Floor PROFESSIONAL SUM...
4             Finance  ﻿ JESSICA CLAIRE . 10th Floor ◆ SUMMARY I am a...

In [12]:
data[['Category','Cleaned_Text']].tail()

,Category,Cleaned_Text
14030,SQL Developer,"﻿ RODOLFO BOTSFORD , Los Angeles, CA • WORK EX..."
14031,Information Technology,﻿ JESSICA CLAIRE . 10th Floor ◆ PROFESSIONAL S...
14032,Operations Manager,﻿ JESSICA CLAIRE . 10th Floor ◆ SUMMARY Dedica...
14033,Banking,﻿ Thomas Johnson Investment Banking Analyst An...
14034,Electrical Engineering,"﻿ STONE BARROWS , Dallas, TX WORK EXPERIENCE S..."

In [15]:
data = data.drop(columns=['Text'])

In [16]:
data.head()

             Category                                       Cleaned_Text
0           Designing  ﻿ JESSICA CLAIRE Montgomery Street, San Franci...
1          Accountant  ﻿ JESSICA CLAIRE Montgomery Street, San Franci...
2       SQL Developer  ﻿ JESSICA CLAIRE , San Francisco, CA 94105 EXP...
3  Operations Manager  ﻿ JESSICA CLAIRE . 10th Floor PROFESSIONAL SUM...
4             Finance  ﻿ JESSICA CLAIRE . 10th Floor ◆ SUMMARY I am a...

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14035 entries, 0 to 14034
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Category      14035 non-null  object
 1   Cleaned_Text  14035 non-null  object
dtypes: object(2)
memory usage: 219.4+ KB

In [17]:
data.to_csv(r'D:\Resume Classification System\data\processed\Preprocessed_Final_Data.csv',index=False)